БухЭксп/InformationRegisters/CW_Переводы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_Переводы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Перевод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектПеревода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыПереводов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>600</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_Переводы/Forms/ФормаРедактированияПереводов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	Параметры.Свойство("ОбъектПеревода",	ОбъектПеревода);
	
	ЗаполнитьСписокДоступныхРеквизитов();
	
	Параметры.Свойство("Реквизит", Реквизит);  
	
	Элементы.ОбъектПеревода.ТолькоПросмотр = ЗначениеЗаполнено(ОбъектПеревода);
	
	Если ЗначениеЗаполнено(ОбъектПеревода) Тогда
		
		Если Не ПустаяСтрока(Реквизит) тогда
			ЗначениеРеквизита = ОбъектПеревода[Реквизит];
		КонецЕсли;
		
		ДобавитьКомандыПеревода();
		ОбновитьПереводыНаСервере();
	КонецЕсли; 
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьСписокДоступныхРеквизитов()
	
	Элементы.Реквизит.СписокВыбора.Очистить();
	
	МетаданыеОбъектаПеревода = ОбъектПеревода.Метаданные();
	Для каждого мдРеквизит из МетаданыеОбъектаПеревода.Реквизиты Цикл    
		Если  мдРеквизит.Тип.СодержитТип(тип("Строка")) Тогда
			Элементы.Реквизит.СписокВыбора.Добавить(мдРеквизит.Имя, мдРеквизит.Синоним);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКомандыПеревода()
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Языки.Код КАК Код,
	               |	CW_Языки.Ссылка КАК Ссылка,
	               |	CW_Языки.Представление КАК Представление
	               |ИЗ
	               |	Справочник.CW_Языки КАК CW_Языки
	               |ГДЕ
	               |	НЕ CW_Языки.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("ИмяКоманды"	, "Язык_"+Строка(Выборка.Код));
		ПараметрыКоманды.Вставить("Заголовок"	, Выборка.Представление +" - " + СокрЛП(Выборка.Ссылка.Наименование));
		ПараметрыКоманды.Вставить("Действие"	, "ДобавитьпереводДляЯзыка");
		ПараметрыКоманды.Вставить("Картинка"	, БиблиотекаКартинок.CW_ЗеленаяТочка);
		
		ПараметрыКнопки = новый Структура;
		ПараметрыКнопки.Вставить("Имя"			, "Кнопка_" + Выборка.Код);
		ПараметрыКнопки.Вставить("Расположение"	, Элементы.ГруппаВсеЯзыки);
		
		ДобавитьКнопкуПеревода(ПараметрыКоманды, ПараметрыКнопки);
		
	КонецЦикла;
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ИмяКоманды"	, "Язык_ЗаполнитьВсе");
	ПараметрыКоманды.Вставить("Заголовок"	, "Заполнить все");
	ПараметрыКоманды.Вставить("Действие"	, "ДобавитьпереводДляЯзыка");
	ПараметрыКоманды.Вставить("Картинка"	, БиблиотекаКартинок.ЗеленыйШар);
	
	ПараметрыКнопки = новый Структура;
	ПараметрыКнопки.Вставить("Имя"			, "Кнопка_ЗаполнитьВсее");
	ПараметрыКнопки.Вставить("Расположение"	, Элементы.ГруппаПереводы);
	
	ДобавитьКнопкуПеревода(ПараметрыКоманды, ПараметрыКнопки);
	
	
КонецФункции

&НаСервере
Процедура ДобавитьКнопкуПеревода(ПараметрыКоманды, ПараметрыКнопки)
	
	НоваяКомандаФормы = ЭтаФорма.Команды.Добавить(ПараметрыКоманды.ИмяКоманды);
	НоваяКомандаФормы.Действие 	= ПараметрыКоманды.Действие;
	НоваяКомандаФормы.Заголовок = ПараметрыКоманды.Заголовок;    
	НоваяКомандаФормы.Картинка  = ПараметрыКоманды.Картинка;    
	НоваяКомандаФормы.ИзменяетСохраняемыеДанные = Истина;
	
	// создадим кнопку
	НовыйЭлемент = Элементы.Добавить(ПараметрыКнопки.Имя,  			// Первый параметр - имя кнопки
										Тип("КнопкаФормы"),  		// Второй параметр - тип элемента управления
										ПараметрыКнопки.Расположение);	// Третий параметр - место расположения на форме
	
	НовыйЭлемент.Вид		= ВидКнопкиФормы.ОбычнаяКнопка; // вид кнопки
	НовыйЭлемент.ИмяКоманды	= ПараметрыКоманды.ИмяКоманды;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьпереводДляЯзыка(Команда)
	
	Если Команда.Имя = "Язык_ЗаполнитьВсе" Тогда
		ЗаполнитьВсеЯзыки();
	Иначе
		//Язык по имени команды
		КодЯзыка = СтрЗаменить(Команда.Имя,"Язык_","");
		
		СпрЯзык = ЕстьСсылкаНаСправочник(КодЯзыка);
		Если НЕ СпрЯзык.Пустая() Тогда
			мСтроки = ТаблицаПереводов.НайтиСтроки(Новый Структура("Язык", СпрЯзык));
			Если мСтроки.Количество() > 0 Тогда
				ПоказатьПредупреждение(,"Для выбранного языка перевод уже назначен!");
			Иначе
				НоваяСтрока = ТаблицаПереводов.Добавить();
				НоваяСтрока.Язык = СпрЯзык;
				
				Если СпрЯзык = ПредопределенноеЗначение("Справочник.CW_Языки.ru") Тогда 
					НоваяСтрока.Перевод = ПолучитьЗначениеПеревода(ОбъектПеревода, Реквизит);
				КонецЕсли;
			Конецесли;
		конецЕсли;
	конецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПеревода(ОбъектПеревода, Реквизит)
	
	Если Не ПустаяСтрока(Реквизит) Тогда
		Возврат Строка(ОбъектПеревода[Реквизит]);
	КонецЕсли; 
	
	Возврат Строка(ОбъектПеревода);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВсеЯзыки()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_Языки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_Языки КАК CW_Языки
	|ГДЕ
	|	CW_Языки.ПометкаУдаления = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		мСтроки = ТаблицаПереводов.НайтиСтроки(Новый Структура("Язык", Выборка.Ссылка));
		Если мСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаПереводов.Добавить();
			НоваяСтрока.Язык = Выборка.Ссылка;
			
			Если Выборка.Ссылка = ПредопределенноеЗначение("Справочник.CW_Языки.ru") Тогда
				Если Не ПустаяСтрока(Реквизит) Тогда
					НоваяСтрока.Перевод = Строка(ОбъектПеревода[Реквизит]);
				Иначе
					НоваяСтрока.Перевод = Строка(ОбъектПеревода);
				КонецЕсли;
			КонецЕсли;
			
		Конецесли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЕстьСсылкаНаСправочник(КодЯзыка)
	
	Возврат Справочники.CW_Языки.НайтиПоКоду(КодЯзыка);
	
КонецФункции

&НаСервере
Процедура ОбновитьПереводыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Переводы.Язык КАК Язык,
	               |	CW_Переводы.Перевод КАК Перевод
	               |ИЗ
	               |	РегистрСведений.CW_Переводы КАК CW_Переводы
	               |ГДЕ
	               |	CW_Переводы.ОбъектПеревода = &ОбъектПеревода
	               |	И CW_Переводы.Реквизит = &Реквизит
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Язык";  
	
	Запрос.УстановитьПараметр("ОбъектПеревода", ОбъектПеревода);
	Запрос.УстановитьПараметр("Реквизит", Реквизит);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТаблицаПереводов.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	ЗаписатьНаСервере();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	НаборПереводов = РегистрыСведений.CW_Переводы.СоздатьНаборЗаписей();
	НаборПереводов.Отбор.ОбъектПеревода.Установить(ОбъектПеревода);
	НаборПереводов.Отбор.Реквизит.Установить(Реквизит);
	
	Для каждого СтрокаПеревода Из ТаблицаПереводов Цикл
		
		Если ЗначениеЗаполнено(СтрокаПеревода.Язык) Тогда
			
			Запись = НаборПереводов.Добавить();
			Запись.ОбъектПеревода 	= ОбъектПеревода;
			Запись.Реквизит 		= Реквизит;
			Запись.Язык 			= СтрокаПеревода.Язык;
			Запись.Перевод 			= СтрокаПеревода.Перевод;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	НаборПереводов.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПереводы(Команда)
	
	ОбновитьПереводыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Не ЗавершениеРаботы Тогда
		Если Модифицированность Тогда
			Отказ = Истина;
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПродолжитьЗакрытиеФормы", ЭтотОбъект, Параметры);
			ПоказатьВопрос(Оповещение, "Записать переводы объекта?", Режим, 0);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПродолжитьЗакрытиеФормы(Результат, Параметры) Экспорт
	
	Модифицированность = Ложь;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.Закрыть();
		Возврат;
	КонецЕсли;
	
	ЗаписатьНаСервере();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПриИзменении(Элемент)
	ОбновитьПереводыНаСервере();
КонецПроцедуры
